INSERT INTO faculties (name) VALUES
('Факультет комп''ютерних наук'),
('Факультет інформаційних технологій'),
('Економічний факультет'),
('Факультет механічної інженерії'),
('Факультет енергетики');


INSERT INTO departments (faculty_id, name) VALUES
(1, 'Кафедра програмної інженерії'),
(1, 'Кафедра комп''ютерних наук'),
(2, 'Кафедра комп''ютерної інженерії'),
(3, 'Кафедра менеджменту'),
(4, 'Кафедра прикладної механіки'),
(5, 'Кафедра електроенергетики');


INSERT INTO specialties (department_id, code, name) VALUES
(1, '121', 'Інженерія програмного забезпечення'),
(2, '122', 'Комп''ютерні науки'),
(3, '123', 'Комп''ютерна інженерія'),
(4, '073', 'Менеджмент'),
(5, '131', 'Прикладна механіка'),
(6, '141', 'Електроенергетика, електротехніка та електромеханіка');


INSERT INTO student_groups (specialty_id, group_number, formation_year) VALUES
(1, 'ПЗ-М126', 2026),
(2, 'КН-М126', 2026),
(3, 'КІ-М126', 2026),
(4, 'МН-М125', 2025),
(6, 'ЕЕ-М126', 2026);


INSERT INTO students (
    record_book_number,
    group_id,
    last_name,
    first_name,
    patronymic,
    permanent_city,
    permanent_street,
    permanent_building,
    current_city,
    current_street,
    current_building,
    scholarship_percent
) VALUES
(
    'RB001', 1,
    'Іваненко', 'Олена', 'Сергіївна',
    'Харків', 'Сумська', '10',
    'Харків', 'Сумська', '10',
    200
),
(
    'RB002', 1,
    'Петренко', 'Максим', 'Олегович',
    'Полтава', 'Європейська', '22',
    'Харків', 'Гуртожиток №1', '15',
    0
),
(
    'RB003', 2,
    'Коваленко', 'Анна', 'Ігорівна',
    'Дніпро', 'Воскресенська', '7',
    'Харків', 'Гуртожиток №2', '8',
    150
),
(
    'RB004', 3,
    'Шевченко', 'Дмитро', 'Андрійович',
    'Харків', 'Науки', '15',
    'Харків', 'Науки', '15',
    0
),
(
    'RB005', 4,
    'Бондаренко', 'Марія', 'Вікторівна',
    'Суми', 'Харківська', '18',
    'Харків', 'Гуртожиток №3', '12',
    100
),
(
    'RB006', 5,
    'Мельник', 'Олексій', 'Петрович',
    'Харків', 'Мироносицька', '31',
    'Харків', 'Мироносицька', '31',
    0
);


INSERT INTO subjects (name) VALUES
('Бази даних'),
('Програмування'),
('Управління ІТ-проєктами'),
('Математичні методи'),
('Англійська мова'),
('Комп''ютерні мережі');


INSERT INTO group_subjects (
    group_id,
    subject_id,
    assessment_type
) VALUES
(1, 1, 'exam'),
(1, 2, 'exam'),
(1, 5, 'credit'),

(2, 1, 'exam'),
(2, 4, 'exam'),

(3, 2, 'exam'),
(3, 6, 'exam'),

(4, 3, 'exam'),

(5, 4, 'exam'),
(5, 5, 'credit');


INSERT INTO session_results (
    student_id,
    group_subject_id,
    grade,
    credit_passed
) VALUES
(1, 1, 5, NULL),
(1, 2, 5, NULL),
(1, 3, NULL, TRUE),

(2, 1, 2, NULL),
(2, 3, NULL, TRUE),

(3, 4, 4, NULL),
(3, 5, 5, NULL),

(4, 6, 4, NULL),

(5, 8, 3, NULL),

(6, 9, 5, NULL);